app/controllers/users_controller.rb

  def index
    @users = User.all
    @user = User.find(current_user.id)
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
  	@user = User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "users" SET "profile_image_id" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["profile_image_id", nil], ["updated_at", "2020-04-06 10:27:21.587552"], ["id", 4]]

  def search
    @user_or_book = params[:option]
    if @user_or_book == "1"
      @users = User.search(params[:search], @user_or_book)
    else
      @books = Book.search(params[:search], @user_or_book)
---
SELECT "users".* FROM "users" WHERE (name LIKE '%')
SELECT "books".* FROM "books" WHERE (title LIKE '%')